technical-documentation/api-reference/getcase/examples/getcase-request-partys.xml

<!-- Example: GetCase Request -->
<!-- Follows ECF 4.0 structure using standard element naming -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ecf="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServiceMessagingProfile-Definitions-4.0"
                  xmlns:tyler="urn:tyler:ecf:extensions:GetCaseMessage"
                  xmlns:nc="http://niem.gov/niem/niem-core/2.0">
  <soapenv:Header/>
  <soapenv:Body>
    <ecf:GetCaseRequest>
      <tyler:GetCaseRequestMessage>
        <tyler:MessageID>0f1c68b3-8a55-4f7c-a41a-123456789abc</tyler:MessageID>
        <tyler:RequestDateTime>2025-11-11T10:30:00Z</tyler:RequestDateTime>
        <tyler:CourtIdentification>
          <nc:IdentificationID>Hopkins:cc</nc:IdentificationID>
        </tyler:CourtIdentification>
        <tyler:CaseTrackingID>CASE-12345678</tyler:CaseTrackingID>
        <tyler:IncludeDocumentMetadata>true</tyler:IncludeDocumentMetadata>
        <tyler:IncludePartyInformation>true</tyler:IncludePartyInformation>
      </tyler:GetCaseRequestMessage>
    </ecf:GetCaseRequest>
  </soapenv:Body>
</soapenv:Envelope>
